Реализовать алгоритмы матричных операций:

Замечание: можно реализовать алгоритмы самостоятельно или воспользоваться готовыми библиотеками.


Для большинства операций используется библиотека Apache Commons Math

Создание матрицы происходит следующим образом:
```java
// Импортируем используемые библиотеки
import org.apache.commons.math3.linear.MatrixUtils;
import org.apache.commons.math3.linear.RealMatrix;
import org.apache.commons.math3.linear.RealMatrixFormat;
// Создаем двумерный массив с данными для матрицы
double[][] firstData = {
        {3, -5, 4},
        {1, 5, -6}};
// Вызываем библиотечную функцию для создания матрицы из двумерного массива
RealMatrix firstMatrix = MatrixUtils.createRealMatrix(firstData);

// Аналагично для следующих матриц
// Матрица для сложиния и вычитания
// Создаем двумерный массив с данными для матрицы
double[][] secondData = {
        {7, 4, 9},
        {4, -3, -8}};
// Вызываем библиотечную функцию для создания матрицы из двумерного массива
        RealMatrix secondMatrix = MatrixUtils.createRealMatrix(secondData);
// Матрица для умножения
// Создаем двумерный массив с данными для матрицы
double[][] thirdData = {
        {1, 2},
        {6, 3},
        {7, 1}};
// Вызываем библиотечную функцию для создания матрицы из двумерного массива
RealMatrix thirdMatrix = MatrixUtils.createRealMatrix(thirdData);
// Создаем объект для форматированного вывода
RealMatrixFormat output = new RealMatrixFormat("", "", "", "", "\n", "     ");
```

* Задания:
1) подпрограмму транспонирования матрицы 

Входные данные: два целых числа n и m (n – количество строк, m – количество столбцов), матрица размерности n x m

Выходные данные: транспонированная матрица размерности m x n

* Решение:

```java
// Создание форматированной транспонированной матрицы
output.format(firstMatrix.transpose());
// Вывод в консоль
System.out.printf("Транспонированая матрица:\n%s\n", output.format(firstMatrix.transpose()));
```
* Результат вывода в консоль:
```text
Транспонированая матрица:
 3     1
-5     5
 4    -6
```


2) подпрограмму умножения матрицы на число 

Входные данные: число-множитель, два целых числа n и m (n – количество строк, m – количество столбцов), матрица размерности n x m

Выходные данные: матрица – результат умножения числа-множителя на исходную матрицу

* Решение:

```java
// Число-множитель
int number = 8;
// Создание форматированной матрицы умноженной на число
output.format(firstMatrix.scalarMultiply(number));
// Вывод в консоль
System.out.printf("Матрица умноженная на число %d:\n%s\n", number, output.format(firstMatrix.scalarMultiply(number)));
```
* Результат вывода в консоль:
```text
Матрица умноженная на число 8:
24     -40     32
8       40    -48
```

3) подпрограмму сложения матриц 

Входные данные: два целых числа n и m (n – количество строк, m – количество столбцов), матрица_1 размерности n ´ m, матрица_2 размерности n ´ m

Выходные данные: матрица – результат сложения матриц

* Решение:

```java
// Сложение матриц и форматирование результата
output.format(firstMatrix.add(secondMatrix));
// Вывод в консоль
System.out.printf("Результат сложения матриц:\n%s\n", output.format(firstMatrix.add(secondMatrix)));
```
* Результат вывода в консоль:
```text
Результат сложения матриц:
10     -1     13
5       2    -14
```

4) подпрограмму вычитания матриц 

Входные данные: два целых числа n и m (n – количество строк, m – количество столбцов), матрица_1 размерности n x m, матрица_2 размерности n x m

Выходные данные: матрица – результат вычитания матриц

* Решение:

```java
// Вычитание матрицы и форматирование результата
output.format(firstMatrix.subtract(secondMatrix));
// Вывод в консоль
System.out.printf("Результат вычитания матриц:\n%s\n", output.format(firstMatrix.subtract(secondMatrix)));
```
* Результат вывода в консоль:
```text
Результат вычитания матриц:
-4     -9     -5
-3      8      2
```


5) подпрограмму умножения матриц 

Входные данные: три целых числа n, m и (n – количество строк матрицы_1, m – количество столбцов матрицы_1 и количество строк матрицы_2, k – количество столбцов матрицы_2), матрица_1 размерности n x m, матрица_2 размерности m x k

Выходные данные: матрица  размерности n ´ k – результат умножения матриц

* Решение:

```java
// Вычитание матрицы и форматирование результата
output.format(firstMatrix.multiply(thirdMatrix));
// Вывод в консоль
System.out.printf("Результат перемножения матриц:\n%s\n", output.format(firstMatrix.multiply(thirdMatrix)));
```
* Результат вывода в консоль:
```text
Результат перемножения матриц:
  1     -5
-11     11
```


6) подпрограммы вычисления норм (||·||1, ||·||e, ||·||∞) матрицы 

Входные данные: два целых числа n и m (n – количество строк, m – количество столбцов), матрица размерности n x m

Выходные данные: соответствующая норма матрицы

* Решения:
---
* Норма - сумма:
```java
System.out.println("||.||1 = " + firstMatrix.getNorm());
```
* Результат вывода в консоль:
```text
||.||1 = 10.0
```
---
* Евклидова норма:
```java
System.out.println("||.||e = " + firstMatrix.getFrobeniusNorm());
```
* Результат вывода в консоль:
```text
||.||e = 10.583005244258363
```
---
* Норма - максимум:
```java
public static Double getMaxNorm(RealMatrix matrix) {
    // Список для хранения суммы строки
    ArrayList<Double> list = new ArrayList<>();
    // Подсчет суммы в строке
    for (int i = 0; i < matrix.getData().length; i++) {
        list.add(Arrays.stream(matrix.getRow(i))
                .map(Math::abs)
                .sum());
    }
        return list.stream().max(Double::compareTo).get();
}
```
* Результат вывода в консоль:
```text
||·||∞ = 12.0
```